Revit 2027 API
AssemblyInstance.RemoveMemberIds Method
 Removes member element ids from the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveMemberIds(
	ICollection<ElementId> memberIds
)
Public Sub RemoveMemberIds (
	memberIds As ICollection(Of ElementId)
)
public:
void RemoveMemberIds(
	ICollection<ElementId^>^ memberIds
)
member RemoveMemberIds :
        memberIds : ICollection<ElementId> -> unit
Parameters
memberIds ICollection<ElementId>
 Element ids to be removed from the assembly instance.
Exceptions
Exception | Condition
ArgumentException |  One or more element ids was not permitted to be removed from the assembly instance. Provided set should not be empty and all elements should be a member of the assembly instance. -or- The provided set includes one or more element ids that cannot be added to or removed from the assembly on their own.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace